#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-terraform-aws-projects-2025/AWS-Image-Labels-Generator/runs/run-mMi1e3qesBzq1aTU

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
random_id.bucket_id: Refreshing state... [id=BBqopg]
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=88b141a93352cb636127fa239ac46625df7ce6bd]
aws_iam_role_policy.lambda_sqs_policy: Refreshing state... [id=rekognition-image-labels-rekognition-lambda-role:LambdaSQSPolicy]
aws_iam_role_policy_attachment.lambda_attach_rekognition: Refreshing state... [id=rekognition-image-labels-rekognition-lambda-role-20260118145920634700000001]
aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=rekognition-image-labels-images-bucket-041aa8a6]
aws_sqs_queue.lambda_dlq: Refreshing state... [id=https://sqs.ap-southeast-1.amazonaws.com/871308866502/rekognition-image-labels-lambda-dlq]
aws_lambda_permission.allow_s3: Refreshing state... [id=AllowExecutionFromS3Bucket]
aws_iam_role_policy_attachment.lambda_attach_s3: Refreshing state... [id=rekognition-image-labels-rekognition-lambda-role-20260118145926685700000003]
aws_iam_policy.rekognition_policy: Refreshing state... [id=arn:aws:iam::871308866502:policy/rekognition-image-labels-rekognition-policy]
aws_iam_role.lambda_role: Refreshing state... [id=rekognition-image-labels-rekognition-lambda-role]
aws_s3_bucket.images_bucket: Refreshing state... [id=rekognition-image-labels-images-bucket-041aa8a6]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=rekognition-image-labels-rekognition-lambda-role-20260118145920640300000002]
aws_s3_bucket_versioning.versioning_images_bucket: Refreshing state... [id=rekognition-image-labels-images-bucket-041aa8a6]
aws_s3_bucket_public_access_block.images_bucket_access: Refreshing state... [id=rekognition-image-labels-images-bucket-041aa8a6]
aws_iam_policy.rekognition_s3_policy: Refreshing state... [id=arn:aws:iam::871308866502:policy/rekognition-image-labels-s3-policy]
aws_s3_bucket_server_side_encryption_configuration.sse: Refreshing state... [id=rekognition-image-labels-images-bucket-041aa8a6]
aws_lambda_function.rekognition_lambda: Refreshing state... [id=rekognition-image-labels-rekognition-lambda]
aws_s3_bucket_lifecycle_configuration.images_bucket_lifecycle: Refreshing state... [id=rekognition-image-labels-images-bucket-041aa8a6]
aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/rekognition-image-labels-rekognition-lambda]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_iam_access_key.project_user_key will be created
  + resource "aws_iam_access_key" "project_user_key" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "rekognition-image-labels-developer-user"
    }

  # aws_iam_group.developer_group will be created
  + resource "aws_iam_group" "developer_group" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "rekognition-image-labels-developer-group"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_membership.developer_team will be created
  + resource "aws_iam_group_membership" "developer_team" {
      + group = "rekognition-image-labels-developer-group"
      + id    = (known after apply)
      + name  = "rekognition-image-labels-group-membership"
      + users = [
          + "rekognition-image-labels-developer-user",
        ]
    }

  # aws_iam_group_policy_attachment.group_attach["arn:aws:iam::871308866502:policy/rekognition-image-labels-rekognition-policy"] will be created
  + resource "aws_iam_group_policy_attachment" "group_attach" {
      + group      = "rekognition-image-labels-developer-group"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::871308866502:policy/rekognition-image-labels-rekognition-policy"
    }

  # aws_iam_group_policy_attachment.group_attach["arn:aws:iam::871308866502:policy/rekognition-image-labels-s3-policy"] will be created
  + resource "aws_iam_group_policy_attachment" "group_attach" {
      + group      = "rekognition-image-labels-developer-group"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::871308866502:policy/rekognition-image-labels-s3-policy"
    }

  # aws_iam_role_policy.lambda_sqs_policy will be destroyed
  # (because aws_iam_role_policy.lambda_sqs_policy is not in configuration)
  - resource "aws_iam_role_policy" "lambda_sqs_policy" {
      - id          = "rekognition-image-labels-rekognition-lambda-role:LambdaSQSPolicy" -> null
      - name        = "LambdaSQSPolicy" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sqs:SendMessage"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:ap-southeast-1:871308866502:rekognition-image-labels-lambda-dlq"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "rekognition-image-labels-rekognition-lambda-role" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.lambda_attach_rekognition will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_attach_rekognition is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_attach_rekognition" {
      - id         = "rekognition-image-labels-rekognition-lambda-role-20260118145920634700000001" -> null
      - policy_arn = "arn:aws:iam::871308866502:policy/rekognition-image-labels-rekognition-policy" -> null
      - role       = "rekognition-image-labels-rekognition-lambda-role" -> null
    }

  # aws_iam_role_policy_attachment.lambda_attach_s3 will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_attach_s3 is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_attach_s3" {
      - id         = "rekognition-image-labels-rekognition-lambda-role-20260118145926685700000003" -> null
      - policy_arn = "arn:aws:iam::871308866502:policy/rekognition-image-labels-s3-policy" -> null
      - role       = "rekognition-image-labels-rekognition-lambda-role" -> null
    }

  # aws_iam_user.project_user will be created
  + resource "aws_iam_user" "project_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "rekognition-image-labels-developer-user"
      + path          = "/"
      + tags          = {
          + "Name" = "rekognition-image-labels-user"
        }
      + tags_all      = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "rekognition-image-labels-user"
          + "Owner"       = "ShenLoong"
          + "Project"     = "rekognition-image-labels"
        }
      + unique_id     = (known after apply)
    }

  # aws_lambda_function.rekognition_lambda will be updated in-place
  ~ resource "aws_lambda_function" "rekognition_lambda" {
        id                             = "rekognition-image-labels-rekognition-lambda"
      ~ last_modified                  = "2026-01-18T15:00:06.723+0000" -> (known after apply)
      ~ source_code_hash               = "ZhzWYR64KWD0JsLBn1mhpbO0x4jW47GXUTrZyZkyckc=" -> "jF/nVIK5zgcK99q3xXnEphnwlZGQXpKSkxV4ajJdKpY="
        tags                           = {}
        # (27 unchanged attributes hidden)

      - dead_letter_config {
          - target_arn = "arn:aws:sqs:ap-southeast-1:871308866502:rekognition-image-labels-lambda-dlq" -> null
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_permission.allow_s3 will be destroyed
  # (because aws_lambda_permission.allow_s3 is not in configuration)
  - resource "aws_lambda_permission" "allow_s3" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "rekognition-image-labels-rekognition-lambda" -> null
      - id                  = "AllowExecutionFromS3Bucket" -> null
      - principal           = "s3.amazonaws.com" -> null
      - source_arn          = "arn:aws:s3:::rekognition-image-labels-images-bucket-041aa8a6" -> null
      - statement_id        = "AllowExecutionFromS3Bucket" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket_notification.bucket_notification will be destroyed
  # (because aws_s3_bucket_notification.bucket_notification is not in configuration)
  - resource "aws_s3_bucket_notification" "bucket_notification" {
      - bucket      = "rekognition-image-labels-images-bucket-041aa8a6" -> null
      - eventbridge = false -> null
      - id          = "rekognition-image-labels-images-bucket-041aa8a6" -> null

      - lambda_function {
          - events              = [
              - "s3:ObjectCreated:*",
            ] -> null
          - id                  = "tf-s3-lambda-20260118150013910200000004" -> null
          - lambda_function_arn = "arn:aws:lambda:ap-southeast-1:871308866502:function:rekognition-image-labels-rekognition-lambda" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # aws_secretsmanager_secret.dev_keys will be created
  + resource "aws_secretsmanager_secret" "dev_keys" {
      + arn                            = (known after apply)
      + description                    = "IAM Access Keys for local Rekognition script"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "rekognition-image-labels-dev-credentials-new"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "rekognition-image-labels"
        }

      + replica (known after apply)
    }

  # aws_secretsmanager_secret_version.dev_keys_val will be created
  + resource "aws_secretsmanager_secret_version" "dev_keys_val" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # aws_sqs_queue.lambda_dlq will be destroyed
  # (because aws_sqs_queue.lambda_dlq is not in configuration)
  - resource "aws_sqs_queue" "lambda_dlq" {
      - arn                               = "arn:aws:sqs:ap-southeast-1:871308866502:rekognition-image-labels-lambda-dlq" -> null
      - content_based_deduplication       = false -> null
      - delay_seconds                     = 0 -> null
      - fifo_queue                        = false -> null
      - id                                = "https://sqs.ap-southeast-1.amazonaws.com/871308866502/rekognition-image-labels-lambda-dlq" -> null
      - kms_data_key_reuse_period_seconds = 300 -> null
      - max_message_size                  = 262144 -> null
      - message_retention_seconds         = 1209600 -> null
      - name                              = "rekognition-image-labels-lambda-dlq" -> null
      - receive_wait_time_seconds         = 20 -> null
      - sqs_managed_sse_enabled           = true -> null
      - tags                              = {} -> null
      - tags_all                          = {
          - "Environment" = "Production"
          - "ManagedBy"   = "Terraform"
          - "Owner"       = "ShenLoong"
          - "Project"     = "rekognition-image-labels"
        } -> null
      - url                               = "https://sqs.ap-southeast-1.amazonaws.com/871308866502/rekognition-image-labels-lambda-dlq" -> null
      - visibility_timeout_seconds        = 30 -> null
        # (7 unchanged attributes hidden)
    }

Plan: 8 to add, 1 to change, 6 to destroy.

Changes to Outputs:
  + developer_access_key_id   = (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 5 estimated
           $0.0/mo +$0.0

```

</details>